# 2. По введенным пользователем координатам двух точек вывести уравнение прямой вида y = kx + b, проходящей через эти точки.
x1 = int(input('Введите координату х первой точки = '))
y1 = int(input('Введите координату y первой точки = '))
x2 = int(input('Введите координату х второй точки = '))
y2 = int(input('Введите координату y второй точки = '))
k = round((y2 - y1)/(x2 - x1), 2)
b = y1 - k * x1
if b < 0:
    print(f'y = {k}x - {abs(b)}')
elif b == 0:
    print(f'y = {k}x')
else:
    print(f'y = {k}x + {b}')